CSI API ETABS v1

# cCaseStaticNonlinearGetGeometricNonlinearity Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetGeometricNonlinearity(
    	string Name,
    	ref int NLGeomType
    )

    Function GetGeometricNonlinearity (
    	Name As String,
    	ByRef NLGeomType As Integer
    ) As Integer

    Dim instance As cCaseStaticNonlinear
    Dim Name As String
    Dim NLGeomType As Integer
    Dim returnValue As Integer

    returnValue = instance.GetGeometricNonlinearity(Name,
    	NLGeomType)

    int GetGeometricNonlinearity(
    	String^ Name,
    	int% NLGeomType
    )

    abstract GetGeometricNonlinearity :
            Name : string *
            NLGeomType : int byref -> int

#### Parameters

Name

    Type: SystemString

NLGeomType

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cCaseStaticNonlinear Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com